# Series

In [2]:
from pandas import Series, DataFrame
import pandas as pd

In [7]:
list_data = [1,2,3,4,5]
list_name = ["a", "b", "c", "d", "e"]
example = Series(data = list_data, index= list_name, name="example_data")
# name : 시리즈 이름 설정
# dtype : 데이터타입

In [8]:
example

a    1
b    2
c    3
d    4
e    5
Name: example_data, dtype: int64

In [10]:
example["a"] # index 로 접근 가능

1

In [12]:
example.values # numpy 형태의 결과 반환

array([1, 2, 3, 4, 5])

In [13]:
example.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [14]:
# 재할당
example.name = 'Renamed'
example.index.name = "alphabet"

In [15]:
example

alphabet
a    1
b    2
c    3
d    4
e    5
Name: Renamed, dtype: int64

In [16]:
# key 값이 짧으면...
dict_data_1 = {'a' : 1, "b":2, "c":3}
indexes = ["a", "b", "c", "d"]

series_obj = Series(data = dict_data_1, index = indexes) # index 가 하나 더 길기 때문에 NaN으로 표기됨

In [18]:
series_obj

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [20]:
type(example.values) # numpy 객체로 반환

numpy.ndarray

# Dataframe

In [23]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [53]:
raw_data = {'first_name': ["Jason", "Molly", "Tina", "Lake"], 'Last_Name': ['aaa','bbb','ccc','ddd'], "age":[42,52,36,50]}

In [54]:
DataFrame(raw_data)

  first_name Last_Name  age
0      Jason       aaa   42
1      Molly       bbb   52
2       Tina       ccc   36
3       Lake       ddd   50

In [55]:
DataFrame(raw_data, columns=["aa", "bb"]) # columns 추출하는 것

Empty DataFrame
Columns: [aa, bb]
Index: []

In [56]:
df = DataFrame(raw_data)

In [57]:
df.first_name # 데이터 호출

0    Jason
1    Molly
2     Tina
3     Lake
Name: first_name, dtype: object

In [58]:
df["first_name"] # 이렇게도 꺼낼 수 있다. 데이터다입 : pd.Series

0    Jason
1    Molly
2     Tina
3     Lake
Name: first_name, dtype: object

In [59]:
# row 를 뽑을 때.
# loc, iloc 사용

df.loc[1] # loc (인덱스의 키값으로 불러옴) : index의 이름으로 불러옴

first_name    Molly
Last_Name       bbb
age              52
Name: 1, dtype: object

In [60]:
df['Last_Name'].iloc[:1]#  : index가 몇 번째 까진지.. (절대위치 느낌)

0    aaa
Name: Last_Name, dtype: object

In [61]:
# column에 새로운 데이터 할당
df['age'] = np.array([42,52,36,50])

In [69]:
df['isOld'] = (df.age > 40)

In [71]:
df

  first_name Last_Name  age  isOld
0      Jason       aaa   42   True
1      Molly       bbb   52   True
2       Tina       ccc   36  False
3       Lake       ddd   50   True

In [73]:
# transpose
df.T

                0      1      2     3
first_name  Jason  Molly   Tina  Lake
Last_Name     aaa    bbb    ccc   ddd
age            42     52     36    50
isOld        True   True  False  True

In [75]:
df.values # 값 출력 = as_matrix

array([['Jason', 'aaa', 42, True],
       ['Molly', 'bbb', 52, True],
       ['Tina', 'ccc', 36, False],
       ['Lake', 'ddd', 50, True]], dtype=object)